{
  "title": "About",
  "slug": "about",
  "published": true,
  "sections": [
    {
      "_block": "sidebar",
      "sidebar": {
        "_block": "about-hero",
        "title": "Hey, I'm Yordan.",
        "headshot": "/images/profile.jpg",
        "location": "Plovdiv, Bulgaria / Remote",
        "expertise": "Data Platforms, Leadership, Systems Design",
        "currently": "Head of Data Engineering at Dext"
      },
      "content": [
        {
          "_block": "text",
          "content": "Achieving a data-driven organization requires a strategic roadmap that connects technical excellence directly to commercial growth. With over 15 years of experience in the technology sector, I help organizations transform complex data ecosystems into clear, competitive advantages.\n\n## A Legacy of Scaling Through Change\n\nMy career is defined by navigating high-stakes environments at three separate unicorns. I have successfully led data teams through four corporate acquisitions, ensuring that unified KPIs and stable reporting remained constant despite shifting ownership structures. These experiences provide me with the frameworks necessary to maintain operational stability while scaling for massive growth.\n\n## Strategic Impact at Scale\n\nCurrently, as the Head of Data Engineering at Dext, I oversee the strategy that powers our global data capabilities. My leadership focuses on three core pillars of organizational success:\n\n*   **Maximizing ROI:** Delivering significant efficiency, including a 50% reduction in infrastructure costs through optimized planning and pipeline execution.\n    \n*   **Operational Scale:** Designing platforms that support rapid expansion, having previously built systems that accommodated 150% growth while improving report speeds by 83%.\n    \n*   **Organizational Alignment:** Unifying commercial data models and processes to ensure every department operates from a single, trusted source of truth.\n    \n\n## Leadership Philosophy\n\nI advocate for the use of reliable, proven technology to solve the most ambitious business challenges. My approach centers on four core principles:\n\n*   **Reliable Foundations:** Choosing stable technologies that allow the organization to focus entirely on solving complex business problems.\n    \n*   **Value-Driven Efficiency:** Prioritizing solutions that deliver high-integrity results with optimal resource investment.\n    \n*   **Measurable Impact:** Ensuring every technical initiative correlates directly with significant organizational growth.\n    \n*   **Radical Clarity:** Maintaining a transparent data strategy that remains accessible and actionable for every stakeholder.\n    \n\n## Advisory and Insights\n\nThrough my newsletter, [_Data Gibberish_](https://www.datagibberish.com/), and my advisory work, I share hard-earned insights to help leaders move toward strategic authority. I am dedicated to helping you establish your data function as a primary driver of business value and long-term innovation."
        }
      ]
    }
  ]
}