{
  "title": "Privacy Policy",
  "slug": "privacy",
  "published": true,
  "sections": [
    {
      "_block": "text",
      "content": "# Privacy Policy\n\n**Last updated:** January 2026\n\nThis policy explains what data is collected through this website, how it's used, and your rights regarding that data.\n\n## Data Controller\nYordan Ivanov is the data controller for information collected through this website. For any privacy-related enquiries, contact: hi@ivanovyordan.com\n\n## Cookie Consent\nThis website uses a cookie consent banner that appears on your first visit. You can choose to:\n- **Accept all cookies** – enables analytics and marketing cookies\n- **Accept essential only** – only functional cookies required for the site to work\n- **Customise** – choose specific cookie categories\n\nYou can change your preferences at any time by clearing your browser cookies and revisiting the site. Your consent choice is stored locally in your browser.\n\n## Analytics Data\nIf you consent to analytics cookies, the following data is collected via **Google Analytics**:\n- Pages visited and time spent\n- Referring website\n- Browser type, device, and screen resolution\n- Approximate location (country/city level)\n- Interactions such as button clicks, form submissions, and external link clicks\n\nThis data is anonymised and used to understand how visitors use the site and improve content. Google Analytics may set cookies including `_ga` and `_gid`. For more information, see [Google's Privacy Policy](https://policies.google.com/privacy).\n\n## Newsletter Subscription\nWhen you subscribe to the newsletter, the following data is collected and stored in **Listmonk** (self-hosted):\n- Email address\n- Subscription date\n- Subscription status (confirmed/unsubscribed)\n\nYour email is used solely to send newsletter content and occasional updates. You can unsubscribe at any time via the link in any email. No double opt-in is required – your subscription is confirmed immediately.\n\n## AI Digital Twin Interactions\nWhen you ask a question to the AI assistant on this site, the following data is logged:\n- Your question\n- The AI's response\n- Whether relevant knowledge was found\n- Your IP address (for rate limiting and abuse prevention)\n- Your country (derived from IP via Cloudflare)\n- Timestamp\n\nThis data is stored in a **Cloudflare D1 database** and is used to:\n- Improve the AI assistant's responses\n- Monitor for abuse\n- Understand what topics visitors are interested in\n\nQuestions are limited to 5 per session to prevent abuse.\n\n## Error Tracking\nThis site uses **Sentry** for error monitoring. When an error occurs, the following may be collected:\n- Error details and stack trace\n- Browser and device information\n- IP address\n- Page URL where the error occurred\n\nThis data is used solely to identify and fix bugs. See [Sentry's Privacy Policy](https://sentry.io/privacy/).\n\n## Session Booking\nIf you book a coaching session, you'll be redirected to **TidyCal**, a third-party scheduling service. TidyCal collects your name, email, and any information you provide in the booking form. See [TidyCal's Privacy Policy](https://tidycal.com/privacy-policy) for details.\n\n## Bot Protection\nThis site uses honeypot fields in forms to detect automated submissions. No personal data is collected through this mechanism – it simply checks if a hidden field was filled (which humans wouldn't see but bots might).\n\n## Data Retention\n- **Analytics data:** Retained according to Google Analytics default settings (14 months)\n- **Newsletter data:** Retained until you unsubscribe, then deleted\n- **AI interaction logs:** Retained indefinitely for service improvement\n- **Error logs:** Retained according to Sentry's default settings (90 days)\n\n## Your Rights (GDPR)\nUnder EU data protection law, you have the right to:\n- **Access** – Request a copy of your personal data\n- **Rectification** – Request correction of inaccurate data\n- **Erasure** – Request deletion of your data (\"right to be forgotten\")\n- **Restriction** – Request limited processing of your data\n- **Portability** – Receive your data in a portable format\n- **Object** – Object to processing based on legitimate interests\n\nTo exercise any of these rights, contact: hi@ivanovyordan.com\n\n## Third-Party Services\nThis site uses the following third-party services:\n- **Cloudflare** – Hosting, CDN, and Workers (US-based, EU-US Data Privacy Framework certified)\n- **Google Analytics** – Website analytics (US-based)\n- **Listmonk** – Newsletter management (self-hosted)\n- **TidyCal** – Session booking (US-based)\n- **Sentry** – Error tracking (US-based)\n- **Google Gemini** – AI responses (US-based)\n\n## Changes to This Policy\nThis policy may be updated from time to time. Significant changes will be noted at the top of this page with the date of the last update."
    }
  ]
}