{
  "title": "Privacy Policy",
  "slug": "privacy",
  "published": true,
  "sections": [
    {
      "_block": "text",
      "content": "# Privacy Policy\n\nThis policy outlines the commitment to your data privacy and the transparent management of information collected through this website.\n\n## Data Integrity and Privacy Commitment\nYour personal information remains a strictly guarded asset. Data usage is limited exclusively to the delivery of leadership insights and strategic advisory services. Your information is held with total confidentiality and remains within this professional ecosystem. I prioritize the security and integrity of your personal information at all times.\n\n## Information Collection\nData is gathered to provide and improve strategic advisory services and newsletter delivery. This includes:\n* **Contact Information:** Email addresses and names provided during newsletter sign-up or session booking.\n* **Professional Context:** Information shared during the advisory booking process to prepare for strategic consultations.\n* **Engagement Data:** Insights into how you interact with the content to ensure the delivery of relevant professional insights.\n\n## Trusted Data Processors\nTo ensure a high-performance experience, data is processed through trusted partners. Email management is handled via Listmonk and Substack, while scheduling is managed through TidyCal. These platforms are selected for their ability to maintain the high standards of data governance required for professional leadership.\n\n## High-Signal Communication\nEmail communications are restricted to the delivery of requested newsletters and strategic updates. I prioritize high-signal content, ensuring every message provides measurable value to your professional journey. You maintain total authority over your subscription status and may update your preferences or opt out at any moment.\n\n## AI and Digital Twin Interactions\nEngagement with the Digital Twin is governed by strict privacy standards. Data shared during AI interactions is used solely to provide immediate, context-aware responses and is managed according to current industry security practices.\n\n## Your Rights and Authority\nIn accordance with global data protection standards and EU regulations, you possess full authority over your data. You may at any time request access to your information, update your personal details, or request the complete removal of your data from all active lists."
    }
  ]
}
