{
  "title": "Terms of Service",
  "slug": "tos",
  "published": true,
  "sections": [
    {
      "_block": "text",
      "content": "# Terms of Service\n\n**Last updated:** January 2026\n\nBy using this website, you agree to these terms. If you don't agree, please don't use the site.\n\n## Website Use\nThis website provides content about data engineering, leadership, and professional development. You may browse the site, read articles, subscribe to the newsletter, and interact with the AI assistant for personal, non-commercial use.\n\n## AI Assistant Usage\nThe AI assistant (\"Digital Twin\") is provided as a helpful tool to answer questions about my work and expertise. By using it, you agree to:\n- **Fair use** – Questions are limited to 5 per session to ensure availability for all visitors\n- **No sensitive data** – Do not submit personal, confidential, or sensitive information in your questions\n- **No guarantees** – AI responses are generated automatically and may not always be accurate or complete\n- **Logging** – Your questions and the AI's responses are logged for service improvement (see Privacy Policy)\n\nThe AI assistant should not be considered professional advice. For specific guidance on your situation, book a coaching session.\n\n## Newsletter\nBy subscribing to the newsletter, you agree to receive email communications about data engineering, leadership insights, and occasional updates about my services. You can unsubscribe at any time via the link in any email.\n\n## Cookies and Tracking\nThis site uses cookies for essential functionality, analytics, and to remember your preferences. By accepting cookies via the consent banner, you agree to this data collection as described in the Privacy Policy.\n\n## Intellectual Property\nAll content on this site – including articles, frameworks, graphics, and code examples – is the original work of Yordan Ivanov unless otherwise noted.\n\nYou may:\n- Share links to content\n- Quote excerpts with attribution\n- Reference ideas with credit\n\nYou may not:\n- Reproduce full articles without permission\n- Use content for commercial purposes without authorisation\n- Remove attribution or claim content as your own\n\n## Coaching and Advisory Services\nIf you book a coaching session:\n- **Scheduling** – Sessions are booked via TidyCal; their terms apply to the booking process\n- **Cancellation** – Please provide at least 24 hours notice for cancellations\n- **Advice** – Guidance provided is based on professional experience but implementation is your responsibility\n- **Confidentiality** – Session content remains confidential unless you agree otherwise\n\n## User Conduct\nWhen using this site, you agree not to:\n- Attempt to bypass rate limits or security measures\n- Submit spam, malicious content, or automated requests\n- Use the AI assistant to generate harmful, illegal, or inappropriate content\n- Interfere with the site's operation or other users' experience\n\n## Disclaimers\n- **No guarantees** – Content is provided \"as is\" without warranties of any kind\n- **External links** – Links to third-party sites are not endorsements; their terms apply\n- **Availability** – The site may be unavailable occasionally for maintenance\n\n## Limitation of Liability\nTo the fullest extent permitted by law, I am not liable for any indirect, incidental, or consequential damages arising from your use of this site or reliance on its content.\n\n## Governing Law\nThese terms are governed by the laws of Bulgaria. Any disputes will be resolved in Bulgarian courts.\n\n## Changes to These Terms\nThese terms may be updated from time to time. Continued use of the site after changes constitutes acceptance of the new terms. Significant changes will be noted with an updated date at the top of this page.\n\n## Contact\nFor questions about these terms, contact: hi@ivanovyordan.com"
    }
  ]
}
